{
  "basic_info": {
    "description_header": "Hi",
    "description": "Seasoned IT professional with 15 years of experience in full-stack development, API integration, and system architecture. Proficient in designing andoptimizing backend solutions using Node.js, JavaScript, C#.NET, and various database technologies. Skilled in cloud computing with AWS and experienced inleading development teams, reviewing code quality, and integrating third-party APIs for digital marketing platforms.",
    "section_name": {
      "about": "About me",
      "projects": "Side Projects",
      "skills": "Skills",
      "experience": "Experience",
      "graduate": "Graduation"
    }
  },
  "projects": [
    {
      "title": "Animal Shelter",
      "startDate": "2020",
      "description": "The most expanded application I had opportunity to work with. I've learned many technologies and my code was reviewed by awesome curator. Application handles all adoption processess and allows to store all evidence on adopting animals from animal shelter.",
      "images": [
        "images/portfolio/animal-shelter/p1.jpg",
        "images/portfolio/animal-shelter/p2.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        }
      ]
    },
    {
      "title": "Photography",
      "startDate": "2018",
      "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
      "images": [
        "images/portfolio/photography/p1.jpg",
        "images/portfolio/photography/p2.jpg"
      ],
      "url": "https://github.com",
      "technologies": [
        {
          "class": "devicon-react-original",
          "name": "React"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        }
      ]
    },
    {
      "title": "3D Object Viewer",
      "startDate": "2015",
      "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
      "images": [
        "images/portfolio/adventure/p1.jpg",
        "images/portfolio/adventure/p2.jpg"
      ],
      "url": "https://github.com",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "VGI Digital Lab",
      "title": "Assistant Manager, Full Stack Developer",
      "years": "Oct 2021 - Present",
      "mainTech": [
        "VGIONE",
        "CDP"
      ],
      "technologies": [
        "AWS",
        "Serverless",
        "C#.NET",
        "Java",
        "JavaScript",
        "PostgreSQL",
        "GraphQL",
        "Elasticsearch",
        "AWS SQS",
        "TypeScript"
      ],
      "description": [
        "Designed, developed, and optimized backend APIs using Node.js, JavaScript, and PostgreSQL on AWS.",
        "Integrated Facebook, Google, and TikTok APIs to enable audience data uploads to ad platforms.",
        "Led API architecture decisions to ensure scalability, performance, and security.",
        "Reviewed and approved pull requests on Bitbucket, ensuring code quality and best practices.",
        "Collaborated with cross-functional teams to integrate APIs with frontend and third-party services.",
        "Developed internal tools and dashboards for monitoring system performance and API usage.",
        "Optimized database queries and indexing strategies for performance improvement.",
        "Managed DevOps pipelines and deployment automation for continuous integration and delivery.",
        "Implemented logging and monitoring using AWS CloudWatch and third-party observability tools.",
        "Enhanced security by implementing role-based access control (RBAC) and JWT authentication."
      ]
    },
    {
      "company": "Thanachart Security",
      "title": "Assistant Manager, Software Development",
      "years": "Jul 2021 - Oct 2021",
      "mainTech": [
        "Backend Mobile API"
      ],
      "technologies": [
        "C#.NET",
        "PostgreSQL",
        "Microsoft SQL"
      ],
      "description": [
        "Developed backend APIs for mobile applications using C#.NET and SQL Server.",
        "Designed and maintained secure authentication and authorization mechanisms.",
        "Enhanced API efficiency and scalability through caching and load balancing techniques.",
        "Worked closely with frontend developers to create seamless user experiences.",
        "Developed and optimized stored procedures for high-performance database operations."
      ]
    },
    {
      "company": "Gosoft Thailand",
      "title": "Development Lead, Specialist",
      "years": "2012 - 2021",
      "mainTech": [
        "Ticket Management System",
        "Contact Center System"
      ],
      "technologies": [
        "Java",
        "Oracle",
        "Node.js",
        "JavaScript",
        "SQL",
        "AWS (Lambda, S3, RDS)"
      ],
      "description": [
        "Designed, developed, and implemented Contact Center Systems and Ticket Management Systems.",
        "Integrated backend solutions with other enterprise systems using Java, Angular, C#.NET, Oracle, MySQL, AWS (Lambda, S3, RDS).",
        "Led development teams and provided mentorship to junior developers.",
        "Spearheaded cloud migration initiatives for legacy applications, reducing infrastructure costs.",
        "Developed RESTful APIs for seamless data exchange across multiple platforms.",
        "Ensured compliance with security best practices and data protection policies.",
        "Designed scalable microservices architecture for high-traffic applications."
      ]
    },
    {
      "company": "KP Soft",
      "title": "System Analyst",
      "years": "2011 - 2012",
      "mainTech": [
        "Personal Loan System",
        "Leasing System"
      ],
      "technologies": [
        "Delphi",
        "Microsoft SQL"
      ],
      "description": [
        "Developed insurance applications using Delphi and SQL Server.",
        "Conducted system analysis to improve performance and security.",
        "Designed and implemented database structures to optimize query performance.",
        "Assisted in requirement gathering and documentation for new system enhancements.",
        "Integrated insurance claims processing with third-party financial services."
      ]
    },
    {
      "company": "Abstract Computer",
      "title": "Programmer",
      "years": "2005 - 2011",
      "mainTech": [
        "Hospital Management System"
      ],
      "technologies": [
        "Oracle",
        "C#.NET",
        "VB.NET",
        "Sybase Data Windows"
      ],
      "description": [
        "Implemented and developed hospital management systems for various hospitals (Bhumibol Adulyadej Hospital, Vajira Hospital, Taksin Hospital, Charoenkrung Pracharak Hospital, Klang Hospital, etc.).",
        "Utilized C#.NET, Oracle, and SQL Server for development.",
        "Developed reporting modules for hospital staff to streamline operations.",
        "Integrated hospital systems with third-party healthcare providers and insurance databases.",
        "Conducted software testing and debugging to maintain system reliability.",
        "Designed HL7 interfaces for secure and standardized health data exchange."
      ]
    }
  ],
  "graduate": [
    {
      "company": "AWS Certification",
      "title": "AWS Cloud Practitioner",
      "years": "01.2021 - present",
      "mainTech": [],
      "technologies": [
        "AWS"
      ]
    },
    {
      "company": "King Mongkut's University Of Technology North Bangkok",
      "title": "Master's degree",
      "years": "01.2010 - 03.2012",
      "mainTech": [
        "Information Technology"
      ],
      "technologies": [
        "Information Technology"
      ]
    }
  ]
}