{
  "basic_info": {
    "description_header": "Hi",
    "description": "Experienced IT professional with over 15 years of expertise in full-stack development, API integration, and system architecture. Adept at designing and optimizing backend solutions using modern technologies such as Node.js, JavaScript, C#.NET, and various database systems. Highly skilled in cloud computing with AWS, leading development teams, ensuring code quality through rigorous reviews, and integrating third-party APIs for enhanced digital marketing capabilities.",
    "section_name": {
      "about": "About me",
      "projects": "Side Projects",
      "skills": "Skills",
      "experience": "Experience",
      "graduate": "Graduation"
    }
  },
  "projects": [
    {
      "title": "Animal Shelter",
      "startDate": "2020",
      "description": "The most expanded application I had opportunity to work with. I've learned many technologies and my code was reviewed by awesome curator. Application handles all adoption processess and allows to store all evidence on adopting animals from animal shelter.",
      "images": [
        "images/portfolio/animal-shelter/p1.jpg",
        "images/portfolio/animal-shelter/p2.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        }
      ]
    },
    {
      "title": "Photography",
      "startDate": "2018",
      "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
      "images": [
        "images/portfolio/photography/p1.jpg",
        "images/portfolio/photography/p2.jpg"
      ],
      "url": "https://github.com",
      "technologies": [
        {
          "class": "devicon-react-original",
          "name": "React"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        }
      ]
    },
    {
      "title": "3D Object Viewer",
      "startDate": "2015",
      "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
      "images": [
        "images/portfolio/adventure/p1.jpg",
        "images/portfolio/adventure/p2.jpg"
      ],
      "url": "https://github.com",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "VGI Digital Lab",
      "title": "Assistant Manager, Full Stack Developer",
      "years": "Oct 2021 - Present",
      "mainTech": [
        "VGIONE",
        "CDP"
      ],
      "technologies": [
        "AWS",
        "Serverless",
        "C#.NET",
        "Java",
        "JavaScript",
        "PostgreSQL",
        "GraphQL",
        "Elasticsearch",
        "AWS SQS",
        "TypeScript"
      ],
      "description": [
        "Designed, developed, and optimized data pipelines to process 100M+ records from Amazon Redshift, transforming and uploading audience data to Facebook, Google, and TikTok APIs for targeted advertising.",
        "Built and launched end-to-end projects from scratch, ensuring scalability, performance, and security of backend APIs using Node.js, JavaScript, and PostgreSQL on AWS.",
        "Led API architecture decisions, ensuring efficient data flow, low latency, and high reliability for digital marketing platforms.",
        "Reviewed and approved pull requests on Bitbucket, enforcing code quality, performance optimization, and best practices.",
        "Worked closely with cross-functional teams to integrate APIs with frontend applications and third-party services.",
        "Developed internal tools and dashboards to monitor system performance, API usage, and data pipeline efficiency.",
        "Optimized database queries and indexing strategies, improving query execution times and overall system responsiveness.",
        "Managed DevOps pipelines and automated deployments using AWS CodePipeline for AWS Serverless Framework (SAM) and Jenkins for seamless CI/CD workflows.",
        "Implemented logging and monitoring using AWS CloudWatch tools to ensure system health and quick issue resolution.",
        "Strengthened system security by implementing Role-Based Access Control (RBAC), OAuth2 authentication, and JWT-based authorization."
      ]
    },
    {
      "company": "Thanachart Security",
      "title": "Assistant Manager, Software Development",
      "years": "Jul 2021 - Oct 2021",
      "mainTech": [
        "Backend Mobile API"
      ],
      "technologies": [
        "C#.NET",
        "PostgreSQL",
        "Microsoft SQL"
      ],
      "description": [
        "Developed backend APIs for mobile applications using C#.NET and SQL Server, ensuring high performance and scalability.",
        "Designed and maintained secure authentication and authorization mechanisms, implementing JWT and OAuth2 for enhanced security.",
        "Created automated test scripts to validate API changes, ensuring that new updates do not impact overall functionality or performance.",
        "Integrated unit and integration tests using Postman, Jest, and Selenium, improving code reliability and reducing production issues.",
        "Enhanced API efficiency and scalability through caching strategies (Redis), query optimization, and load balancing techniques.",
        "Worked closely with frontend developers to debug and optimize API responses, creating a seamless user experience.",
        "Developed and optimized stored procedures and indexing strategies for high-performance database operations, reducing query execution time."
      ]
    },
    {
      "company": "Gosoft Thailand",
      "title": "Development Lead, Specialist",
      "years": "2012 - 2021",
      "mainTech": [
        "Ticket Management System",
        "Contact Center System"
      ],
      "technologies": [
        "Java",
        "Oracle",
        "Node.js",
        "JavaScript",
        "SQL",
        "AWS (Lambda, S3, RDS)"
      ],
      "description": [
        "Designed, developed, and implemented Contact Center Systems and Ticket Management Systems.",
        "Integrated backend solutions with other enterprise systems using Java, Angular, C#.NET, Oracle, MySQL, AWS (Lambda, S3, RDS).",
        "Led development teams and provided mentorship to junior developers.",
        "Spearheaded cloud migration initiatives for legacy applications, reducing infrastructure costs.",
        "Developed RESTful APIs for seamless data exchange across multiple platforms.",
        "Ensured compliance with security best practices and data protection policies.",
        "Designed scalable microservices architecture for high-traffic applications."
      ]
    },
    {
      "company": "KP Soft",
      "title": "System Analyst",
      "years": "2011 - 2012",
      "mainTech": [
        "Personal Loan System",
        "Leasing System"
      ],
      "technologies": [
        "Delphi",
        "Microsoft SQL"
      ],
      "description": [
        "Developed insurance applications using Delphi and SQL Server.",
        "Conducted system analysis to improve performance and security.",
        "Designed and implemented database structures to optimize query performance.",
        "Assisted in requirement gathering and documentation for new system enhancements.",
        "Integrated insurance claims processing with third-party financial services."
      ]
    },
    {
      "company": "Abstract Computer",
      "title": "Programmer",
      "years": "2005 - 2011",
      "mainTech": [
        "Hospital Management System"
      ],
      "technologies": [
        "Oracle",
        "C#.NET",
        "VB.NET",
        "Sybase Data Windows"
      ],
      "description": [
        "Implemented and developed hospital management systems for various hospitals (Bhumibol Adulyadej Hospital, Vajira Hospital, Taksin Hospital, Charoenkrung Pracharak Hospital, Klang Hospital, etc.).",
        "Utilized C#.NET, Oracle, and SQL Server for development.",
        "Developed reporting modules for hospital staff to streamline operations.",
        "Integrated hospital systems with third-party healthcare providers and insurance databases.",
        "Conducted software testing and debugging to maintain system reliability.",
        "Designed HL7 interfaces for secure and standardized health data exchange."
      ]
    }
  ],
  "graduate": [
    {
      "company": "AWS Certification",
      "title": "AWS Cloud Practitioner",
      "years": "01.2021 - present",
      "mainTech": [],
      "technologies": [
        "AWS"
      ]
    },
    {
      "company": "King Mongkut's University Of Technology North Bangkok",
      "title": "Master's degree",
      "years": "01.2010 - 03.2012",
      "mainTech": [
        "Information Technology"
      ],
      "technologies": [
        "Information Technology"
      ]
    }
  ]
}